{
  "doc_type": "EXPORT_DECLARATION",
  "export_declaration_no": "Find the export declaration number by labels like \"Numero de identificacion\", \"Customs export declaration No\", \"ID/Reference No\". Keep the exact value (letters/digits) and add to export_declaration_no.",
  "export_declaration_date": "Determine the declaration date by label \"FECHA/Date\" in the header. If technical dates exist (\"Aceptacion a tramite\", \"Autorizacion de salida\"), prioritize the main declaration date. Add to export_declaration_date.",
  "invoice_no": "Extract invoice number(s) from the invoice reference block, e.g., \"Numero y fecha de Invoices / Factura de exportacion\". If multiple, join with \"; \". Add to invoice_no.",
  "invoice_date": "Take invoice date(s) next to invoice number(s) (\"Numero y fecha...\"). If multiple, join with \"; \". Keep format as in document and add to invoice_date.",
  "country_of_origin": "If the export declaration explicitly shows origin country (e.g., \"Pais de origen / Country of origin\"), extract it. If missing, leave empty (do not infer from exporter or port). Add to country_of_origin.",
  "producer": "If the producer is listed as \"Producer/Manufacturer/Fabricante\" (often in goods description or notes), extract the legal name. If multiple, join with \"; \". Add to producer.",
  "buyer": "Identify the buyer by field \"Consignatario / Consignee / Buyer\". Keep the full name (and address if shown) in one line. Add to buyer.",
  "seller": "If the export declaration explicitly has \"Seller/Supplier/Vendedor\", extract it. If not (typical), leave empty. Add to seller.",
  "exporter": "Take the exporter from \"Consignante o Exportador / Exporter\". Keep the full legal name (and address if shown) in one line and add to exporter.",
  "incoterms": "Extract Incoterms from \"Clausula de venta / Terms of sale\" (e.g., FOB/CFR/CIF/DAP). Keep the code and place (port/city) if shown. Add to incoterms.",
  "total_price": "Take the overall total. Prefer the total aligned with Incoterms: for FOB use \"Total Valor FOB\", for CIF use \"Valor CIF\". If no explicit total, sum line \"Valor FOB\" values. Keep currency and number format as in the document. Add to total_price.",
  "proforma_no": "If the declaration references a proforma (\"Proforma Invoice\", \"PI\", \"Proforma No.\"), extract number(s). If multiple, join with \"; \". Add to proforma_no.",
  "HS_code": "Collect all tariff codes from line items (\"Cod. Arancel\", \"HS Code\", \"Tariff code\"). Record unique codes in one list separated by \"; \", keeping document format (e.g., 0304.81.20). Add to HS_code.",
  "products": "The \"products\" block is expandable: create product_1, product_2, ... for each line item (ITEM 1, ITEM 2, ...) in the goods description section. Keep order from the document. Fill all available fields for each position; if a shared attribute is given once (e.g., one Latin species), duplicate it in the relevant product_i. In token_refs include references to source text/table fragments used.",
  "products[*].name_product": "Take the commercial description from \"Descripcion de mercancias / Description of goods / Nombre\". If multi-line (including \"Observaciones\"), join into one line. Add to products[i].name_product.",
  "products[*].latin_name": "If a Latin species name appears in parentheses (e.g., \"SALMO SALAR\"), extract it and add to products[i].latin_name. If none, leave empty.",
  "products[*].size_product": "Extract size/grade (e.g., \"Calibre 3-4 LBS\", \"1.3-1.8 KG\", \"80/120\"). Keep as printed and add to products[i].size_product.",
  "products[*].unit_box": "Take unit of measure from the corresponding column (e.g., \"U. Medida / Unit\", values like \"KG\", \"CASE\", \"PCS\", sometimes \"KN\" = kilos netos). Add to products[i].unit_box.",
  "products[*].packages": "State number of packages from \"Number and kind of packages / Cantidad de bultos / Cases/Cartons\". If packing type is shown (e.g., \"1375 CAJAS\"), keep number and type in one line. Add to products[i].packages.",
  "products[*].price_per_unit": "Take unit price from \"Precio unitario FOB / Unit price\". Keep currency and number format (dot/comma) as in the document. Add to products[i].price_per_unit.",
  "products[*].total_price": "Take the line total (usually \"Valor FOB\" for the line). If no explicit value, compute as quantity x unit price, keeping currency and format. Add to products[i].total_price.",
  "products[*].net_weight": "Extract net weight per line. In some Chile forms net weight is shown as \"KN\" (kilos netos) in the table; it may also use \"Peso Neto / Net weight\". Keep number and unit as in the document. Add to products[i].net_weight.",
  "products[*].gross_weight": "Extract gross weight per line from \"Peso Bruto / Gross weight\". Keep number format and unit. Add to products[i].gross_weight."
}
