{
  "doc_type": "SPECIFICATION",
  "specification_date": "Find the specification date by label \"Specification\"/\"Date\". Keep the exact format from the document (no normalization). Add the date to specification_date.",
  "contract_no": "Extract the contract number by labels \"Contract No\", \"Contract No.\", or \"Contract\". Write only the number (no date or counterparty). Add it to contract_no.",
  "additional_agreements": "If the document mentions addenda (\"Addendum\", \"Supplementary Agreement\", \"DS No...\"), extract their numbers (and dates if present) in one line; if multiple, join with \"; \". Add to additional_agreements.",
  "buyer": "Identify the buyer by labels \"Buyer\", \"Customer\", \"Consignee\". Keep the full legal name (and address if shown) in one line. Add to buyer.",
  "seller": "Identify the seller by labels \"Seller\", \"Supplier\". Keep the full legal name (and address if shown) in one line. Add to seller.",
  "incoterms": "Extract Incoterms: a three-letter code (EXW/FOB/CFR/CIF/DAP, etc.) and, if shown, the place (port/city). Keep the wording exactly as in the document. Add to incoterms.",
  "terms_of_payment": "Find payment terms (\"Terms of payment\", \"Payment\"). Keep the full wording (e.g., \"ADV. 20%, BALANCE C/COPY DOC.\"). Add to terms_of_payment.",
  "total_price": "Take the overall total for the specification (\"Total ...\", possibly with Incoterms and currency). Prefer the explicit total; if missing, sum line amounts. Keep currency and number format as in the document. Add to total_price.",
  "HS_code": "If the specification has a list of HS codes, collect all unique codes (format \"0304.81...\") and join with \"; \". If codes are only in line items, collect them from the table. Add to HS_code.",
  "country_of_origin": "If \"Country of origin\"/\"Origin\" is explicitly shown, extract the origin country (e.g., \"CHILE\") and add to country_of_origin. If missing, leave empty (do not infer).",
  "products": "The \"products\" block is expandable: create product_1, product_2, ... for each line item in the table and keep order. For each position fill all available fields. If an attribute is given once in a shared block (e.g., one Latin species for all positions), duplicate it in the relevant product_i. In token_refs include references to the source fragments/cells used.",
  "products[*].name_product": "Take the commercial name from the \"Description of goods\"/\"Product\" column. If multi-line, join into one line. Add to products[i].name_product.",
  "products[*].latin_name": "If a Latin species name is shown (often in parentheses, e.g., \"SALMO SALAR\"), extract it and add to products[i].latin_name. If not shown, leave empty.",
  "products[*].size_product": "Extract size/grade/pack (e.g., \"3-4 LB (1.3-1.8 KG)\", \"80/120\"). Keep the wording as in the document. Add to products[i].size_product.",
  "products[*].unit_box": "If a unit is explicitly shown (\"per carton\", \"per kg\", \"unit\", \"CASE\", etc.), extract and add to products[i].unit_box. If not shown, leave empty.",
  "products[*].packages": "Extract number of packages by labels \"Packages\", \"Cases\", \"Cartons\", \"No. of packages\". If type is shown, keep both (e.g., \"1375 CASES\"). Add to products[i].packages.",
  "products[*].net_weight": "Extract net weight per item (\"Net weight\", \"NET KG\", etc.). Keep number and unit as in the document (dot/comma). Add to products[i].net_weight.",
  "products[*].gross_weight": "Extract gross weight per item (\"Gross weight\", \"G.W.\"). Keep number and unit as in the document. Add to products[i].gross_weight.",
  "products[*].price_per_unit": "Find unit price by labels \"Unit price\", \"Price per ...\". Keep currency and number format exactly as in the document. Add to products[i].price_per_unit.",
  "products[*].total_price": "Extract the line total (\"Line total\", \"Amount\"). If no explicit value, compute as quantity/weight x price_per_unit, keeping currency and format. Add to products[i].total_price."
}
