{
  "doc_type": "BILL_OF_LANDING",

  "bill_of_landing_number": "Ищи заголовок с меткой «BILL OF LADING No.» или «SEA WAYBILL No.»/«B/L No.». Сохраняй номер строго в том виде, как напечатан (включая буквы/цифры/пробелы), и добавь его в поле bill_of_landing_number.",

  "bill_of_landing_date": "Найди дату оформления коносамента по меткам «PLACE AND DATE OF ISSUE», «ISSUE DATE», иногда рядом указан «SHIPPED ON BOARD DATE». Если в документе есть несколько дат, предпочитай «ISSUE DATE/PLACE AND DATE OF ISSUE». Добавь дату в поле bill_of_landing_date.",

  "exporter": "Возьми значение из блока «SHIPPER». Сохрани полное наименование (и адрес, если присутствует) как одну строку без сокращений. Добавь текст в поле exporter.",

  "importer": "Возьми значение из блока «CONSIGNEE». Сохрани полное наименование (и адрес, если присутствует) как одну строку. Добавь текст в поле importer.",

  "destination": "Извлеки пункт назначения по меткам «PORT OF DISCHARGE» или «PLACE OF DELIVERY». Если указаны оба, предпочитай «PORT OF DISCHARGE». Добавь значение в поле destination.",

  "vessel": "Найди строку «VESSEL AND VOYAGE NO.» (может включать название судна и номер рейса/рейса: напр., «MSC ISABELLA - GT538W»). Сохрани строку целиком и добавь её в поле vessel.",

  "container_no": "Извлеки номер(а) контейнера формата 4 буквы + 7 цифр (напр., BMOU9288991). Если указано несколько контейнеров, сохрани все значения в одной строке через «; ». Добавь строку в поле container_no.",

  "linear_seal": "Извлеки номер(а) линейной пломбы по меткам «Seal Number»/«SEAL NO.» рядом с контейнером. Если номеров несколько, перечисли через «; ». Добавь значение(я) в поле linear_seal.",

  "veterinary_seal": "Ищи явные метки «Veterinary seal»/«Health seal»/«Ветеринарная пломба». Не путай с «Seal Number» (линейная пломба) и «VET.CERT.» (номер ветсертификата). Если в документе нет явного номера ветпломбы — оставь поле пустым. Добавь найденное значение в поле veterinary_seal.",

  "packages": "Извлеки количество мест/упаковок по меткам «No. of packages», «Case(s)», «Carton(s)», «Packages». Если указано «Total Items», используй количество мест для груза, а не число контейнеров. Добавь число в поле packages.",

  "net_weight": "Извлеки массу нетто по меткам «N.W.» или «NET WEIGHT». Сохрани число вместе с единицей измерения, как в документе (напр., «22,687.500 KGS»), и добавь его в поле net_weight.",

  "gross_weight": "Извлеки массу брутто по меткам «GROSS WEIGHT»/«GROSS CARGO WEIGHT». Если присутствуют разные варианты (например, с/без паллет), выбери общий «Gross weight» без уточнений. Добавь значение в поле gross_weight.",

  "country_of_origin": "Если в коносаменте явно указана «Country of origin», извлеки страну происхождения и добавь её в поле country_of_origin. Если явной метки нет, оставь поле пустым (не выводи страну по отправителю или порту загрузки).",

  "name_product": "Возьми коммерческое наименование из раздела «Description of Packages and Goods» (например, «FROZEN ATLANTIC SALMON FILLETS»). Сохраняй текст без латинского названия вида (его помести в latin_name). Добавь строку в поле name_product.",

  "latin_name": "Если рядом с описанием в скобках указано латинское название вида (например, «SALMO SALAR», «OCTOPUS VULGARIS»), извлеки его и добавь в поле latin_name. Если нет — оставь пустым.",

  "commodity_code": "Если в коносаменте приведён «HS CODE»/«Tariff code», извлеки числовой код (например, «0304.81») в точном формате из документа и добавь его в поле commodity_code. Если кода нет — оставь пустым.",

  "size_product": "Если в описании присутствует размер/градация (например, «3-4 LB», «80/120»), извлеки и добавь в поле size_product. Если размер не указан — оставь пустым."
}
