{
  "doc_type": "CERTIFICATE_OF_ORIGIN",

  "certificate_of_origin_no": "Найди номер сертификата по меткам «Certificate of Origin No», «Certificate No», «Register No», «REG. No» или «REGISTER Nº». Сохраняй точную строку (буквы/цифры/символы) и добавь в поле certificate_of_origin_no.",

  "certificate_of_origin_date": "Определи дату выдачи сертификата по блоку сертифицирующего органа («Place and date, signature and stamp of certifying authority»). Если есть несколько дат (например, дата декларации экспортёра и дата сертификации), отдай приоритет дате сертификации. Добавь дату в поле certificate_of_origin_date.",

  "invoice_no": "Извлеки номер(а) инвойса из секции с явной ссылкой на инвойс (например, «Number and date of Invoices»). Если номеров несколько, перечисли через «; ». Добавь значение(я) в поле invoice_no.",

  "invoice_date": "Рядом с номером инвойса извлеки дату(ы) инвойса. Если несколько — перечисли через «; ». Сохраняй формат как в документе и добавь дату(ы) в поле invoice_date.",

  "country_of_origin": "Ищи явную метку «Origin: …», «Country of origin» или заголовок с указанием страны происхождения (например, «Goods produced in …»). Извлеки страну и добавь в поле country_of_origin.",

  "exporter": "Возьми полное юридическое наименование экспортёра из секции «Goods consigned from (Exporter’s …)». Сохрани строку целиком (при наличии адреса — в одной строке) и добавь в поле exporter.",

  "importer": "Возьми полное юридическое наименование импортёра/получателя из секции «Goods consigned to (Consignee’s …)». Сохрани строку целиком (при наличии адреса — в одной строке) и добавь её в поле importer.",

  "destination": "Определи пункт/страну назначения по полям «Importing country», «To … (route)» или аналогичной пометке. Предпочитай явное поле «Importing country»; при наличии города доставки укажи его вместе со страной. Добавь значение в поле destination.",

  "vessel": "Найди сведения о транспорте и маршруте («Means of transport and route»). Извлеки наименование судна и, если указано, номер рейса/войяжа как единую строку. Добавь её в поле vessel.",

  "container_no": "В блоке маркировок/упаковок извлеки номер(а) контейнера формата 4 буквы + 7 цифр (например, BMOU9288991). Если контейнеров несколько — перечисли через «; ». Добавь значение(я) в поле container_no.",

  "veterinary_seal": "Извлекай только явные номера ветеринарных пломб («Veterinary seal», «Health seal»). Не путай с линейной пломбой/Seal No. Если номера нет — оставь пустым. Добавь найденное значение в поле veterinary_seal.",

  "linear_seal": "Если в сертификате указаны номера пломб («Seal No.», «Seal Number») для контейнеров — извлеки их. При множественных значениях перечисли через «; ». Добавь значение(я) в поле linear_seal.",

  "HS_code": "Если указан «HS CODE»/«Tariff code», извлеки код(ы) в точном формате (например, 0304.81). Если кодов несколько (по строкам товаров) — собери уникальные и перечисли через «; ». Добавь значение в поле HS_code.",

  "products": "Блок «products» расширяемый: создай product_1, product_2, … по количеству товарных строк. Соблюдай порядок следования. Для каждой позиции заполняй все доступные поля и указывай token_refs для исходных фрагментов. Если часть атрибутов указана общим блоком (например, один HS-код для всех), дублируй эти значения во все соответствующие product_i.",

  "products[*].name_product": "Возьми коммерческое наименование из описания товара (например, «FROZEN ATLANTIC SALMON FILLET»). Если описание многострочное — объедини в одну строку. Латинское видовое имя вынеси отдельно в latin_name. Добавь текст в products[i].name_product.",

  "products[*].latin_name": "Если рядом с описанием указано латинское видовое название в скобках (например, «SALMO SALAR»), извлеки его и добавь в products[i].latin_name. Если нет — оставь пустым.",

  "products[*].size_product": "Если указан размер/градация (например, «3–4 LB», «80/120», «1.3–1.8 KG»), извлеки как единую строку и добавь в products[i].size_product. Если размер не указан — оставь пустым.",

  "products[*].unit_box": "Если явно указана учётная/ценовая единица («per carton», «per kg», «unit»), извлеки её и добавь в products[i].unit_box. Если единица не указана в CoO — оставь пустым (не выдумывай).",

  "products[*].packages": "Извлеки количество мест/упаковок по пометкам «Number and kind of packages», «Cases/Cartons/Packages». Сохрани число и при необходимости тип (например, «1375 CASES») в одной строке. Добавь значение в products[i].packages.",

  "products[*].price_per_unit": "Если в CoO указана цена за единицу (встречается редко), извлеки её с валютой/форматом как в документе и добавь в products[i].price_per_unit. Если цены нет — оставь пустым.",

  "products[*].total_price": "Если в CoO указана итоговая стоимость по позиции (редко), извлеки её с валютой/форматом как в документе и добавь в products[i].total_price. Если суммы нет — оставь пустым (не вычисляй).",

  "products[*].net_weight": "Извлеки нетто по позиции («NET KGS», «Net weight», возможно внутри описания). Сохраняй число и единицу как в документе. Добавь значение в products[i].net_weight.",

  "products[*].gross_weight": "Извлеки брутто по позиции из поля «Gross weight»/«Gross weight or other quantity». Сохраняй формат числа и единицу. Добавь значение в products[i].gross_weight."
}
