{
  "doc_type": "EXPORT_DECLARATION",

  "export_declaration_no": "Найди номер ЭД по меткам вроде «Número de identificación», «Customs export declaration No», «ID/Reference No». Сохраняй точное значение (буквы/цифры) и добавь его в поле export_declaration_no.",

  "export_declaration_date": "Определи дату декларации по метке «FECHA/Date» в шапке формы. Если в документе есть технические даты («Aceptación a trámite», «Autorización de salida»), приоритет отдавай основной дате декларации. Добавь дату в поле export_declaration_date.",

  "invoice_no": "Извлеки номер(а) инвойса из блока со ссылкой на счета, например «Número y fecha de Invoices / Factura de exportación». Если номеров несколько — перечисли через «; ». Добавь значение(я) в поле invoice_no.",

  "invoice_date": "Возьми дату(ы) инвойса, идущие рядом с номером(ами) инвойса («Número y fecha…»). Если несколько — перечисли через «; ». Сохраняй формат, как в документе, и добавь дату(ы) в поле invoice_date.",

  "country_of_origin": "Если в ЭД явно указана страна происхождения (напр., «País de origen / Country of origin»), извлеки её. Если поле отсутствует, оставь пустым (не выводи страну по косвенным признакам типа отправителя или порта). Добавь значение в поле country_of_origin.",

  "producer": "Если производитель указан как «Producer/Manufacturer/Fabricante» (часто в описании товара или примечаниях), извлеки юридическое наименование. При нескольких значениях — перечисли через «; ». Добавь текст в поле producer.",

  "buyer": "Определи покупателя по полю «Consignatario / Consignee / Buyer». Сохрани полное наименование (и адрес, если указан) одной строкой. Добавь текст в поле buyer.",

  "seller": "Если в ЭД явно присутствует «Seller/Supplier/Vendedor», извлеки это значение. Если такого поля нет (что типично), оставь пустым. Добавь найденный текст в поле seller.",

  "exporter": "Возьми экспортёра из поля «Consignante o Exportador / Exporter». Сохрани полное юридическое наименование (и адрес, если есть) одной строкой и добавь его в поле exporter.",

  "incoterms": "Извлеки условия поставки из поля «Cláusula de venta / Terms of sale» (напр., FOB/CFR/CIF/DAP). Сохраняй код ИНКОТЕРМС и, если указан, пункт (порт/город). Добавь строку в поле incoterms.",

  "total_price": "Возьми общий итог по документу. Предпочитай итог, согласованный с ИНКОТЕРМС: при FOB — «Total Valor FOB», при CIF — «Valor CIF». Если явного итога нет, суммируй построчные значения «Valor FOB». Сохрани валюту и формат числа как в документе. Добавь строку в поле total_price.",

  "proforma_no": "Если ЭД ссылается на проформу («Proforma Invoice», «PI», «Proforma No.»), извлеки номер(а). При множественных значениях — перечисли через «; ». Добавь значение(я) в поле proforma_no.",

  "HS_code": "Собери все встречающиеся коды ТН ВЭД из граф по строкам («Cód. Arancel», «HS Code», «Tariff code»). Запиши уникальные коды в один список, разделённый «; », сохранив формат из документа (напр., 0304.81.20). Добавь строку в поле HS_code.",

  "products": "Блок «products» расширяемый: создай product_1, product_2, … по количеству товарных строк (ITEM 1, ITEM 2, …) в разделе описания товаров. Соблюдай порядок из документа. Для каждой позиции заполняй все доступные поля; если общий атрибут указан один раз (например, общий латинский вид), продублируй его в соответствующие product_i. В token_refs указывай ссылки на исходные фрагменты текста/таблицы, из которых собрано значение.",

  "products[*].name_product": "Возьми коммерческое описание из блока «Descripción de mercancías / Description of goods / Nombre». Если описание разбито на несколько строк (включая «Observaciones»), объедини в одну строку. Добавь текст в products[i].name_product.",

  "products[*].latin_name": "Если рядом с описанием указан латинский вид в скобках (например, «SALMO SALAR»), извлеки его отдельно и добавь в products[i].latin_name. Если нет — оставь пустым.",

  "products[*].size_product": "Извлеки размер/калибр (напр., «Calibre 3–4 LBS», «1.3–1.8 KG», «80/120»). Сохрани запись как в документе и добавь в products[i].size_product.",

  "products[*].unit_box": "Возьми единицу учёта/измерения из соответствующей графы (напр., «U. Medida / Unit», значения вроде «KG», «CASE», «PCS», иногда «KN» = kilos netos). Добавь значение в products[i].unit_box.",

  "products[*].packages": "Укажи количество мест/упаковок по графе «Number and kind of packages / Cantidad de bultos / Cases/Cartons». Если тип тары указан (например, «1375 CAJAS»), сохрани число и тип в одной строке. Добавь значение в products[i].packages.",

  "products[*].price_per_unit": "Возьми цену за единицу из графы «Precio unitario FOB / Unit price». Сохраняй валюту и формат числа (точка/запятая) как в документе. Добавь значение в products[i].price_per_unit.",

  "products[*].total_price": "Возьми построчную сумму (обычно «Valor FOB» для строки). Если явного значения нет, вычисли как количество × цена за единицу, сохранив формат и валюту. Добавь сумму в products[i].total_price.",

  "products[*].net_weight": "Извлеки нетто по позиции. В некоторых формах Чили нетто обозначают «KN» (kilos netos) в табличной части; также могут использовать «Peso Neto / Net weight». Сохрани число и единицу как в документе. Добавь значение в products[i].net_weight.",

  "products[*].gross_weight": "Извлеки брутто по позиции из поля «Peso Bruto / Gross weight». Сохраняй формат числа и единицу. Добавь значение в products[i].gross_weight."
}
