{
  "doc_type": "PACKING_LIST",

  "packing_list_date": "Извлеки дату пакинг-листа из зоны заголовка/шапки («Packing List», «DATE»). Если дата разбита на день/месяц/год, собери в одну строку без нормализации формата. Добавь найденную дату в поле packing_list_date.",

  "invoice_no": "Найди ссылку на инвойс по меткам «Invoice No», «P.Code or Invoice N°», «Commercial Invoice». Сохраняй номер точь-в-точь как в документе (включая символы «N°», дефисы и т.п.) и добавь его в поле invoice_no.",

  "producer": "Если указан производитель («Producer», «Manufacturer», наименование завода/фабрики) — извлеки полное юр. наименование, при наличии адреса оставь в одной строке. Добавь значение в поле producer.",

  "buyer": "Если в бланке есть «Buyer», «Customer», «Consignee» — извлеки полное наименование (и адрес, если есть) одной строкой. Добавь текст в поле buyer. Если поле отсутствует — оставь пустым.",

  "seller": "Если в бланке есть «Seller», «Supplier», «Shipper» — извлеки полное наименование одной строкой. Добавь текст в поле seller. Если поле отсутствует — оставь пустым.",

  "veterinary_seal": "Ищи явное упоминание ветеринарной пломбы («Veterinary seal», «Health seal»). Не путай с линейной пломбой «Seal No». Если номер ветпломбы указан — сохрани его как есть и добавь в поле veterinary_seal; если нет — оставь пустым.",

  "linear_seal": "Извлеки номер(а) линейной пломбы по меткам «Seal No», «Seal Number». Если значений несколько (несколько контейнеров) — перечисли через «; ». Добавь значение(я) в поле linear_seal.",

  "country_of_origin": "Если явно указана «Country of origin / Origin» — извлеки страну и добавь в поле country_of_origin. Если нет явного поля, оставь пустым (не выводи страну по косвенным признакам).",

  "products": "Блок «products» расширяемый: создай product_1, product_2, … в порядке следования товарных строк в документе. Для каждой позиции заполняй все доступные поля. Если какой-то атрибут указан один раз общим блоком для нескольких строк (например, один латинский вид), продублируй его во все соответствующие product_i. В token_refs укажи ссылки на исходные фрагменты текста/таблицы, из которых собрано значение.",

  "products[*].name_product": "Возьми коммерческое наименование из описания позиции («Product», «Description of goods»), например «FROZEN ATLANTIC SALMON FILLET …». Объедини переносы в одну строку. Добавь текст в products[i].name_product.",

  "products[*].latin_name": "Если возле описания указан латинский вид (часто в скобках, например «SALMO SALAR»), извлеки его отдельно и добавь в products[i].latin_name. Если не указан — оставь пустым.",

  "products[*].size_product": "Извлеки размер/калибр (например, «3-4 LB (1.3-1.8 KG)», «80/120»). Сохрани формат как в источнике и добавь в products[i].size_product.",

  "products[*].unit_box": "Если явно обозначена учётная/ценовая единица или единица упаковки («Unit», «per carton», «per kg», «CASE» и т.п.) — извлеки её и добавь в products[i].unit_box. Если не указана — оставь пустым.",

  "products[*].packages": "Извлеки количество мест/упаковок по меткам «Cases», «Cartons», «Packages», «No. of packages». Если указан и тип тары — сохрани в одной строке (например, «1375 CASES»). Добавь значение в products[i].packages.",

  "products[*].net_weight": "Возьми нетто («Net Weight», «NET»). Сохрани число и единицу («KG» и т.п.) в исходном формате (точки/запятые). Добавь значение в products[i].net_weight.",

  "products[*].net_weight_with_glaze": "Если указано «Net Weight with Glazing» — извлеки это значение отдельно от обычного нетто и добавь его в products[i].net_weight_with_glaze. Если отсутствует — оставь пустым.",

  "products[*].net_weight_with_ice": "Если указано «Net Weight with Ice» — извлеки это значение и добавь в products[i].net_weight_with_ice. Если отсутствует — оставь пустым.",

  "products[*].net_weight_with_glaze_and_pack": "Извлеки показатель вида «Net Weight with Glazing and Primary [Packing]» (или аналогичную формулировку) как отдельное значение. Добавь его в products[i].net_weight_with_glaze_and_pack. Если отсутствует — оставь пустым.",

  "products[*].gross_weight": "Возьми брутто («Gross Weight», «G.W.»). Сохрани число и единицу как в документе. Добавь значение в products[i].gross_weight.",

  "products[*].price_per_unit": "Если в пакинг-листе указана цена за единицу (встречается не всегда), извлеки её с валютой и исходным форматированием и добавь в products[i].price_per_unit. Если цены нет — оставь пустым.",

  "products[*].total_price": "Если в пакинг-листе указана итоговая стоимость по позиции, извлеки её с валютой и форматом и добавь в products[i].total_price. Если суммы нет — оставь пустым (не вычисляй).",

  "products[*].factory_number": "Извлеки номер завода/предприятия производителя (например, «Establishment No», «Factory No», регистрационный номер цеха), если он указан для позиции. Добавь значение в products[i].factory_number.",

  "products[*].date_of_production": "Извлеки дату производства по позиции («Date of production», «Production date», «Дата производства»). Если дат несколько (диапазон) — сохрани как в источнике одной строкой. Добавь значение в products[i].date_of_production."
}
