{
  "doc_type": "PRICE_LIST_2",

  "price_list_2_date": "Найди дату прайс-листа по метке «DATE»/«Date» в шапке/титуле прайса. Используй точный формат из документа (не нормализуй) и добавь дату в поле price_list_2_date.",

  "producer": "Возьми юридическое наименование производителя по метке «Producer»/«Manufacturer» или из контактного блока компании, выпускающей прайс. Сохрани полное название (и адрес, если рядом) одной строкой. Добавь текст в поле producer.",

  "seller": "Если в прайсе явно указан «Seller»/«Supplier», извлеки полное наименование (и адрес, если есть) одной строкой. Если такой метки нет, оставь пустым (не подменяй продавца производителем). Добавь значение в поле seller.",

  "incoterms": "Извлеки условия поставки в формате ИНКОТЕРМС (например, «CFR SAINT-PETERSBURG, RUSSIA»). Сохрани код (EXW/FOB/CFR/CIF/DAP и т.д.) и пункт так, как напечатано, и добавь строку в поле incoterms.",

  "valid_till": "Найди срок действия прайса по метке «VALID TILL»/«Valid until». Сохрани значение (дату/период) в исходном виде и добавь его в поле valid_till.",

  "HS_code": "Если в прайсе указан «HS CODE»/«Tariff code», извлеки код (или коды) в точном формате (напр., «0304.81»). Если кодов несколько, перечисли через «; ». Добавь строку в поле HS_code. Если кода нет — оставь пустым.",

  "country_of_origin": "Если указан «ORIGIN OF GOODS»/«Country of origin», извлеки страну происхождения (напр., «CHILE») и добавь её в поле country_of_origin. Если поле отсутствует — оставь пустым.",

  "products": "Блок «products» расширяемый: создай product_1, product_2, … по количеству товарных строк/позиций в том порядке, как в прайсе. Для каждой позиции заполняй все доступные поля; если общий атрибут (напр., один латинский вид для нескольких позиций) указан один раз, продублируй его в соответствующие product_i. В token_refs указывай ссылки на исходные фрагменты (ячейки/строки), из которых собрано значение.",

  "products[*].name_product": "Возьми коммерческое наименование из колонки «PRODUCT»/«Description» (например, «FROZEN ATLANTIC SALMON FILLET TRIM D VP PREMIUM …»). Объедини переносы строк, сохраняя точное написание. Добавь текст в products[i].name_product.",

  "products[*].latin_name": "Если рядом с наименованием указан латинский вид в скобках (например, «Salmo salar»), извлеки его отдельно и добавь в products[i].latin_name. Если латинское имя отсутствует — оставь пустым.",

  "products[*].size_product": "Извлеки размер/градацию (например, «3–4 LB (1.3–1.8 KG)», «80/120»). Сохрани обе системы измерений, если напечатаны обе. Добавь строку в products[i].size_product.",

  "products[*].unit_box": "Зафиксируй учётную единицу, если явно указана. Сохрани формулировку как в документе и добавь в products[i].unit_box.",

  "products[*].packages": "Если в прайсе есть колонка/поле про упаковки («Packages», «Cartons», «Cases») — извлеки количество и, при наличии, тип (например, «10 CARTONS»). Если такого поля нет — оставь пустым. Добавь значение в products[i].packages.",

  "products[*].price_per_KG": "Найди цену за единицу в колонке «Price», «Price per KG» и т.п. Сохрани валюту и формат числа (точка/запятая) ровно как в документе. Не вычисляй и не меняй НДС. Добавь значение в products[i].price_per_KG.",

  "products[*].total_price": "Если в прайс-листе у позиции есть итоговая сумма (метки вроде «Total», «Line total», «Ext. price»), извлеки её со всеми символами валюты и в исходном формате числа. Если такого столбца нет — оставь поле пустым (не вычисляй как packages × price_per_unit). Добавь найденное значение в products[i].total_price."
}
