{
  "doc_type": "QUALITY_CERTIFICATE",

  "quality_certificate_date": "Найди дату сертификата в заголовке/шапке рядом с местом выдачи (пример: «Puerto Montt, July 13th. 2025»). Сохраняй точный формат из документа и добавь дату в поле quality_certificate_date.",

  "producer": "Возьми юридическое наименование производителя из блока «Name and Address of processing Plant» (пример: «GRANJA MARINA TORNAGALEONES S A …»). Сохрани только наименование (адрес можно опустить) и добавь его в поле producer.",

  "container_no": "Извлеки номер(а) контейнера из строки «Container and Seals Number», формат обычно 4 буквы + 7 цифр (пример: «BMOU 9288991»). Если контейнеров несколько — перечисли через «; ». Добавь значение(я) в поле container_no.",

  "vessel": "Найди «Name of Vessel» и извлеки название судна и, если указано, номер рейса/войяжа в одной строке (пример: «MSC TAKORADI VIII - NX528R»). Добавь строку в поле vessel.",

  "veterinary_seal": "Извлекай только явные номера ветеринарных/санитарных пломб («Veterinary/Health seal»). Не путай с линейной пломбой «Seal». Если в документе приводится только «SEAL: …» без пометки о ветеринарной пломбе — это линейная пломба, оставь veterinary_seal пустым. Добавь найденное значение в поле veterinary_seal.",

  "linear_seal": "Возьми номер(а) линейной пломбы из «Container and Seals Number / SEAL: …» (пример: «FX34197306; A0036355»). Если номеров несколько — запиши через «; ». Добавь значение(я) в поле linear_seal.",

  "products": "Блок «products» расширяемый: создай product_1, product_2, … по количеству товарных позиций/табличных строк в документе и соблюдай их порядок. Для каждого product_i заполняй все доступные поля. Если атрибут указан один раз общим блоком (например, один латинский вид для всех строк), продублируй его в соответствующие product_i. В token_refs укажи ссылки на исходные фрагменты (ячейки/строки), из которых собрано значение.",

  "products[*].name_product": "Возьми коммерческое наименование из «Description of Goods» (пример: «FROZEN ATLANTIC SALMON FILLETS»). Объедини переносы в одну строку и добавь текст в products[i].name_product.",

  "products[*].latin_name": "Если рядом указано научное (латинское) название из «Species and Scientific name» — извлеки его отдельно (пример: «SALMO SALAR») и добавь в products[i].latin_name. Если нет — оставь пустым.",

  "products[*].size_product": "Если присутствует размер/калибр/фасовка в описании товара — извлеки как единую строку и добавь вместе в products[i].size_product. Если размер не указан в сертификате — оставь пустым.",

  "products[*].unit_box": "Если указан тип единицы/тары (например, «Kind of Packing: CASES»), сохрани формулировку («CASES», «BOXES», и т.п.) и добавь её вместе в products[i].unit_box. Если нет явной единицы — оставь пустым.",

  "products[*].packages": "Извлеки количество мест из «Number of Packages» (пример: «1375»). При наличии типа тары («Kind of Packing: CASES») можно сохранить «1375 CASES» одной строкой. Добавь значение в products[i].packages.",

  "products[*].gross_weight": "Если в сертификате дана масса брутто по позиции — извлеки число с единицей в исходном формате и добавь в products[i].gross_weight. Если указан только суммарный брутто в примечаниях/итогах — используй явное табличное значение; при отсутствии брутто оставь пустым.",

  "products[*].net_weight": "Извлеки нетто по позиции. Если указан общий «Total Net Weight», а по позициям приведены нетто в таблице — используй табличные значения для products[i].net_weight, общий итог не дублируй в позиции. Добавь значение в products[i].net_weight. (Пример суммарного нетто: «Total Net Weight: 20.625,00».)",

  "products[*].date_of_production": "Возьми дату(ы) производства из раздела «Production Date». Если дат несколько (табличные строки), перечисли их через «; » в одной строке и добавь каждую дату в products[i].date_of_production. Не путай с «Expiry Date»."
}
