{
  "doc_type": "SPECIFICATION",

  "specification_date": "Найди дату спецификации по метке «Specification»/«Date». Сохраняй точный формат из документа (не нормализуй). В конце добавь дату в поле specification_date.",

  "contract_no": "Извлеки номер контракта по меткам «Contract No», «Договор №». Запиши только номер (без даты и названия контрагента). В конце добавь его в поле contract_no.",

  "additional_agreements": "Если в документе упомянуты доп. соглашения («Addendum», «Supplementary Agreement», «ДС №…»), извлеки их номера (и при наличии — даты) одной строкой; если их несколько — перечисли через «; ». В конце добавь значение в поле additional_agreements.",

  "buyer": "Определи покупателя по меткам «Buyer», «Customer», «Consignee». Сохрани полное юр. наименование (и адрес, если указан) одной строкой. В конце добавь текст в поле buyer.",

  "seller": "Определи продавца по меткам «Seller», «Supplier». Сохрани полное юр. наименование (и адрес, если указан) одной строкой. В конце добавь текст в поле seller.",

  "incoterms": "Извлеки условия поставки (ИНКОТЕРМС): трёхбуквенный код (EXW/FOB/CFR/CIF/DAP и т.п.) и, если указан, пункт (порт/город). Сохрани формулировку ровно как в документе. В конце добавь строку в поле incoterms.",

  "terms_of_payment": "Найди условия оплаты («Terms of payment», «Payment»). Сохрани полную формулировку (например, «ADV. 20%, BALANCE C/COPY DOC.»). В конце добавь её в поле terms_of_payment.",

  "total_price": "Возьми общий итог по спецификации («Total …», возможно с упоминанием ИНКОТЕРМС и валюты). Предпочитай явное итого; если отсутствует, суммируй построчные суммы. Сохраняй валюту и формат числа как в документе. В конце добавь строку в поле total_price.",

  "HS_code": "Если в спецификации есть общий список кодов ТН ВЭД, собери все уникальные коды (формата «0304.81…») и запиши одной строкой через «; ». Если коды указаны только по строкам, собери их из таблицы. В конце добавь строку в поле HS_code.",

  "country_of_origin": "Если явно указана «Country of origin»/«Origin», извлеки страну происхождения (например, «CHILE») и добавь её в поле country_of_origin. Если поле отсутствует — оставь пустым (не выводи по косвенным признакам).",

  "products": "Блок «products» расширяемый: создай product_1, product_2, … по количеству товарных строк в таблице и соблюдай их порядок. Для каждой позиции заполняй все доступные поля. Если какой-то атрибут указан один раз общим блоком (например, один латинский вид для всех позиций), продублируй его в соответствующие product_i. В token_refs укажи ссылки на исходные фрагменты/ячейки, из которых собрано значение.",

  "products[*].name_product": "Возьми коммерческое наименование из колонки «Description of goods»/«Product». Если описание многострочное — объедини в одну строку. В конце добавь текст в products[i].name_product.",

  "products[*].latin_name": "Если рядом с наименованием указан латинский вид (часто в скобках, например «SALMO SALAR»), извлеки его отдельно и добавь в products[i].latin_name. Если не указан — оставь пустым.",

  "products[*].size_product": "Извлеки размер/калибр/фасовку (например, «3–4 LB (1.3–1.8 KG)», «80/120»). Сохрани запись как в документе. В конце добавь строку в products[i].size_product.",

  "products[*].unit_box": "Если явно указана учётная («per carton», «per kg», «unit», «CASE» и т.п.) — извлеки её и добавь в products[i].unit_box. Если единица не указана — оставь пустым.",

  "products[*].packages": "Извлеки количество мест/упаковок по меткам «Packages», «Cases», «Cartons», «No. of packages». Если указан и тип тары — сохрани обе части (например, «1375 CASES»). В конце добавь значение в products[i].packages.",

  "products[*].net_weight": "Извлеки массу нетто по позиции («Net weight», «NET KG» и т.п.). Сохраняй число и единицу в исходном виде (точка/запятая). В конце добавь значение в products[i].net_weight.",

  "products[*].gross_weight": "Извлеки массу брутто по позиции («Gross weight», «G.W.»). Сохраняй число и единицу в исходном виде. В конце добавь значение в products[i].gross_weight.",

  "products[*].price_per_unit": "Найди цену за единицу по меткам «Unit price», «Price per …». Сохрани валюту и формат числа точно как в документе. В конце добавь значение в products[i].price_per_unit.",

  "products[*].total_price": "Извлеки построчную сумму («Line total», «Amount»). Если явного значения нет, вычисли как количество/вес × price_per_unit, сохранив валюту и формат. В конце добавь сумму в products[i].total_price."
}
