{
  "doc_type": "VETERINARY_CERTIFICATE",

  "veterinary_certificate_no": "Возьми номер сертификата из п.1.5 «Certificate / Сертификат №» или из нижнего колонтитула «Certificate Number …». Сохрани строку ровно как в бланке и добавь её в поле veterinary_certificate_no.",

  "veterinary_certificate_date": "Найди дату и место выдачи в строке «PLACE AND DATE OF ISSUE» (внизу документа, например «TALCAHUANO 02/07/2025»). Сохрани формат как в источнике и добавь дату в поле veterinary_certificate_date.",

  "producer": "Извлеки наименование предприятия из п.3.1 «Name (Nº) and address of establishment…» (это производитель/завод; нередко рядом указан Establishment No). Сохрани полное юр. наименование одной строкой и добавь его в поле producer.",

  "buyer": "Возьми получателя из п.1.2 «Name and address of consignee». Сохрани наименование (и адрес, если указан) одной строкой и добавь в поле buyer.",

  "exporter": "Возьми отправителя/экспортёра из п.1.1 «Name and address of consignor». Сохрани наименование (и адрес, если указан) одной строкой и добавь в поле exporter.",

  "vessel": "В п.1.3 «Means of transport» извлеки название судна без номера контейнера (например, «MSC TAKORADI VIII NX528R»). Сохрани в одной строке и добавь в поле vessel.",

  "container_no": "В п.1.3 найди номер(а) контейнера формата 4 буквы + 7 цифр (например, «BMOU9288991»). Если их несколько — перечисли через «; ». Добавь значение(я) в поле container_no.",

  "veterinary_seal": "Из п.2.6 «Number of seal» извлеки номер(а) ветпломбы (Health/Veterinary seal), если значение приведено общим блоком. Если номеров несколько — перечисли через «; ». Добавь значение(я) в поле veterinary_seal.",

  "country_of_origin": "Определи страну происхождения по п.1.6 (Competent authority/страна) или по формулировке происхождения в шаблоне; зафиксируй именно страну (например, «CHILE»). Добавь её в поле country_of_origin.",

  "products": "Блок «products» расширяемый: создай product_1, product_2, … по количеству товарных строк/партии в разделах 2.1–2.8. Соблюдай порядок. Если атрибут указан один раз общим блоком (например, одна ветпломба/один латинский вид), продублируй его в соответствующие product_i. В token_refs укажи ссылки на исходные фрагменты (ячейки/строки), из которых собрано значение. :contentReference[oaicite:9]{index=9}",

  "products[*].name_product": "П.2.1 «Name of the product». Извлеки коммерческое наименование (например, «ATLANTIC SALMON … FILLETS» без латинского вида) и добавь текст в products[i].name_product.",

  "products[*].latin_name": "П.2.1: если рядом с наименованием указан латинский вид в скобках (например, «SALMO SALAR»), извлеки его отдельно и добавь вместе в products[i].latin_name. Если нет — оставь пустым.",

  "products[*].packages": "П.2.4 «Number of packages». Извлеки количество мест. Если указано несколько значений (по партиям) — перечисли через «; » в одной строке. Добавь значение в products[i].packages.",

  "products[*].net_weight": "П.2.5 «Net weight (kg)». Извлеки массу нетто (в кг) ровно в исходном формате (точка/запятая). Если значений несколько — перечисли через «; ». Добавь число(а) в products[i].net_weight.",

  "products[*].factory_number": "П.2.7 «Identification marks». Извлеки регистрационный номер предприятия/establishment No (например, «10751»). Если значений несколько — перечисли через «; ». Добавь значение в products[i].factory_number.",

  "products[*].date_of_production": "П.2.2 «Date of production». Если дат несколько, перечисли их через «; » одной строкой. Добавь в products[i].date_of_production.",

  "products[*].seal_number": "П.2.6 «Number of seal». Извлеки номер(а) ветпломбы для позиции. Если в сертификате указан один номер для всей партии — продублируй его и на уровень документа (поле veterinary_seal). Несколько значений перечисли через «; ». Добавь значение(я) в products[i].seal_number.",

  "products[*].unit_box": "Это поле соответствует п.2.3 «Type of package». Извлеки тип упаковки (например, «CARDBOARD BOXES»). Сохрани формулировку как в бланке и добавь в products[i].unit_box."
}
